step3/uml/packages.dot
digraph "packages" {
charset="utf-8"
rankdir=BT
"1" [label="boiler", shape="box"];
"2" [label="condenser", shape="box"];
"3" [label="node", shape="box"];
"4" [label="pump", shape="box"];
"5" [label="rankine", shape="box"];
"6" [label="turbine", shape="box"];
"1" -> "3" [arrowhead="open", arrowtail="none"];
"2" -> "3" [arrowhead="open", arrowtail="none"];
"4" -> "3" [arrowhead="open", arrowtail="none"];
"5" -> "1" [arrowhead="open", arrowtail="none"];
"5" -> "2" [arrowhead="open", arrowtail="none"];
"5" -> "3" [arrowhead="open", arrowtail="none"];
"5" -> "4" [arrowhead="open", arrowtail="none"];
"5" -> "6" [arrowhead="open", arrowtail="none"];
"6" -> "3" [arrowhead="open", arrowtail="none"];
}
